
#Task 1

ids = {'user1': [213, 213, 213, 15, 213],
       'user2': [54, 54, 119, 119, 119],
       'user3': [213, 98, 98, 35]}

unique_id_var2 = list()
for val in ids.values():
    unique_id_var2 += val


print(set(unique_id_var2))

# Task 2

month = input('Введите месяц: ')
print()
date = int(input('Введите число: '))
print()

my_dict = {'Март': (21, 'Рыбы', 'Овен'),
           'Апрель': (20, 'Овен', "Телец"),
           "Май": (21, "Телец", "Близнецы"),
           "Июнь": (21, "Близнецы", "Рак"),
           "Июль": (23, "Рак", "Лев"),
           "Август": (23, "Лев", "Дева"),
           "Сентябрь": (23, "Дева", "Весы"),
           "Октябрь": (23, "Весы", "Скорпион"),
           "Ноябрь": (22, "Скорпион", "Стрелец"),
           "Декабрь": (22, "Стрелец", "Козерог"),
           "Январь": (20, "Козерог", "Водолей"),
           "Февраль": (19, "Водолей", "Рыбы")}

if date >= my_dict[month[0]]:
    print(my_dict[month[2]])
else:
    print(my_dict[month[1]])

